        identification division.
        program-id. testprog2.

        data division.
        working-storage section.

        procedure division.

        display "Testprog - 2" end-display
        call "testprog3" end-call
        
        goback.
