        identification division.
        program-id. testprog3.

        data division.
        working-storage section.

        procedure division.

        display "Testprog - 3" end-display
        
        goback.
